{"name":"cyanogen-os","count":108,"items":[{"title":"Best Phone under Rs. 15,000 in India for November 2016","date":"2016-11-11"},{"title":"A British phone you're not embarrassed to carry? You heard that right","date":"2016-11-03"},{"title":"Cyanogen OS 13 is rolling out to the Wileyfox Spark and Spark+","date":"2016-09-15"},{"title":"CyanogenMod rolls out a new stable snapshot build of CM 13","date":"2016-08-16"},{"title":"CyanogenMod rolls out a new stable snapshot build of CM 13","date":"2016-08-16"},{"title":"Wileyfox Spark review: Could do better","date":"2016-07-29"},{"title":"Cyanogen OS vs Android: what’s the difference?","date":"2016-07-27"},{"title":"Cyanogen: CyanogenMod is here to stay","date":"2016-07-26"},{"title":"Steve Kondik reassures community CyanogenMod is here to stay, calls \"app pivot\" untrue","date":"2016-07-25"},{"title":"Cyanogen Inc shifts focus to apps as OS staff reportedly laid off","date":"2016-07-23"},{"title":"Sources: Cyanogen Inc. is undergoing major layoffs, may \"pivot\" to apps","date":"2016-07-22"},{"title":"Understanding the differences between CyanogenMod, Cyanogen OS & Cyanogen, Inc.","date":"2016-07-07"},{"title":"Cyanogen OS 13.1 with new MOD features coming to OnePlus One","date":"2016-06-11"},{"title":"Cyanogen OS 13.1 now available for the OnePlus One - introduces MODs for Cortana and more","date":"2016-06-10"},{"title":"MOD ready Cyanogen OS 13.1 is now available for the OnePlus One","date":"2016-06-10"},{"title":"Cyanogen OS 13.1 Is Rolling Out With MOD Support, Twitter, Skype, OneNote, Cortana, and Hyperlapse included","date":"2016-06-10"},{"title":"Can XDA-Developers be the Answer for Android Update Woes?","date":"2016-06-02"},{"title":"Yu devices to get stable Marshmallow in the next month","date":"2016-05-24"},{"title":"Lenovo ZUK Z1 review: Good combination of hardware and software that is priced right!","date":"2016-05-16"},{"title":"First Impressions: Zuk Z1 – Golden Oldie?","date":"2016-05-13"},{"title":"Low price-high specs game not sustainable in the long run, says YU Televentures’ Rahul Sharma","date":"2016-05-12"},{"title":"YU ends exclusive partnership with Cyanogen as users prefer stock Android: CEO Rahul Sharma","date":"2016-05-10"},{"title":"Lenovo ZUK Z1 with Cyanogen OS 12.1 to launch in India on May 10; here’s everything you need to know","date":"2016-05-05"},{"title":"Lenovo says Cyanogen OS is no longer exclusive to Micromax: Report","date":"2016-05-03"},{"title":"Cyanogen OS powered Zuk Z1 heads to India, Yu exclusive comes to an end","date":"2016-05-02"},{"title":"Obi Worldphone, company founded by ex-Apple CEO John Sculley, announces new $139 Android device","date":"2016-02-23"},{"title":"Cyanogen enables deeper integrations with new “MOD” platform for apps","date":"2016-02-22"},{"title":"Cyanogen is opening native APIs up to third-party developers","date":"2016-02-22"},{"title":"Obi Worldphone Launches New Model, MV1, at Mobile World Congress","date":"2016-02-22"},{"title":"Cyanogen’s ‘MOD’ platform gives developers (Microsoft) access to deeper Android integration","date":"2016-02-22"},{"title":"Cyanogen launches the “Mod” platform, with lots of Microsoft integration","date":"2016-02-22"},{"title":"Cyanogen launches new MOD platform to let developers tap into the OS","date":"2016-02-22"},{"title":"Cyanogen Introduces MOD to Usher in the Post-App Era","date":"2016-02-22"},{"title":"India overtakes the U.S. to become the world's second-largest smartphone market","date":"2016-02-03"},{"title":"CyanogenMod 13 Nightlies Come To The Motorola RAZR, Droid RAZR, Droid Bionic, Droid 4, And Wileyfox Swift And Storm","date":"2016-01-21"},{"title":"OnePlus 2 vs YU Yutopia vs Qiku Q Terra : The Value for Money Flagship Battle","date":"2016-01-12"},{"title":"Cyanogen OS suggests users download Microsoft OneDrive to open files","date":"2016-01-08"},{"title":"Cyanogen OS 12.1.1 With Cortana Integration Is Rolling Out To The OnePlus One","date":"2016-01-05"},{"title":"Cyanogen OS 12.1 With Deeply Integrated Cortana Now Available For The OnePlus One: Here’s How To Install","date":"2016-01-05"},{"title":"Cyanogen OS update with Cortana now rolling out to the OnePlus One","date":"2016-01-04"},{"title":"PlayStation 4 hacked to run Linux","date":"2016-01-04"},{"title":"YU Yutopia review: Is it the flagship killer you were waiting for?","date":"2015-12-31"},{"title":"At least six vendors to release Cyanogen powered phones in India next year","date":"2015-12-22"},{"title":"Cyanogen-Powered Yutopia Flagship Announced, Coming December 26th To India For INR 24,999","date":"2015-12-17"},{"title":"Microsoft just beat Apple to the punch in a big way","date":"2015-12-10"},{"title":"Microsoft Cortana now available on Android, iOS and Cyanogen","date":"2015-12-10"},{"title":"Cortana makes the leap to iOS and Android but saves the best for Cyanogen","date":"2015-12-10"},{"title":"Microsoft Extends Cortana's Reach to iPhones, Android and Cyanogen","date":"2015-12-09"},{"title":"Microsoft announces Cortana for \"select iPhone, Android and Cyanogen OS powered devices\"","date":"2015-12-09"},{"title":"Microsoft just beat Apple to the punch in a big way","date":"2015-12-09"},{"title":"Microsoft Extends Cortana's Reach to iPhones, Android and Cynogen","date":"2015-12-09"},{"title":"Order the Cyanogen powered Lenovo ZUK Z1 at Gearbest","date":"2015-12-07"},{"title":"Cyanogen 12.1 OTA update rolling out for the Yu Yuphoria","date":"2015-12-05"},{"title":"YU Yuphoria to get Cyanogen OS 12.1 Update Starting Tonight","date":"2015-12-04"},{"title":"Cyanogen OS 12.1 update for YU Yuphoria arrives today","date":"2015-12-04"},{"title":"Cyanogen 12.1 OTA update now rolling out for the Yu Yuphoria","date":"2015-12-04"},{"title":"YU Yuphoria to get Cyanogen OS 12.1 Update Starting Tonight","date":"2015-12-04"},{"title":"Cyanogen OS 12.1 Begins Rolling Out To Yureka And Yureka Plus","date":"2015-11-03"},{"title":"Will Microsoft's Cortana replace Google Now on CyanogenOS?","date":"2015-09-14"},{"title":"Cyanogen CEO says Cortana is coming to the mobile OS, but Microsoft refuses to confirm","date":"2015-09-11"},{"title":"Microsoft's Cortana may come to next Cyanogen OS release, CEO reveals - GeekWire","date":"2015-09-11"},{"title":"Initial impressions of the ZUK Z1 $300 Cyanogen-powered Android smartphone | ZDNet","date":"2015-09-10"},{"title":"OnePlus 2 review: A great deal, but an uninspiring handset","date":"2015-09-04"},{"title":"Cyanogen OS 12.1 update for OnePlus One rolling out OTA","date":"2015-08-27"},{"title":"Wileyfox launches its first Cyanogen OS smartphones, the 5\" Swift and 5.5\" Storm","date":"2015-08-25"},{"title":"Wileyfox launches its first Cyanogen OS smartphones, the 5\" Swift and 5.5\" Storm","date":"2015-08-25"},{"title":"ZUK Officially Launches the International Version of Its Acclaimed Z1 in Partnership with Cyanogen","date":"2015-08-21"},{"title":"ZUK Z1: Lenovo-backed company to launch flagship with Cyanogen OS!","date":"2015-08-21"},{"title":"ZUK Officially Launches the International Version of Its Acclaimed Z1 in Partnership with Cyanogen","date":"2015-08-21"},{"title":"ZUK Z1 now sold in Europe via Amazon, powered by Cyanogen OS","date":"2015-08-21"},{"title":"Lenovo's ZUK announces partnership with Cyanogen","date":"2015-08-20"},{"title":"Micromax YU Yuphoria review: a future Android One killer","date":"2015-07-20"},{"title":"CyanogenMod is building an open-source browser for Android","date":"2015-07-02"},{"title":"Next Cyanogen phone canceled, MediaTek probably to blame","date":"2015-07-02"},{"title":"Some of the most nagging OnePlus One bugs supposedly fixed in Cyanogen OS update","date":"2015-06-18"},{"title":"Cyanogen OS to integrate Playphone gaming social network in phones | Digit.in","date":"2015-06-12"},{"title":"OnePlus 2 launch confirmed, to include Oxygen OS for Android v5.1 | Digit.in","date":"2015-06-11"},{"title":"Playphone's mobile game-centric app store is coming to Cyanogen OS","date":"2015-06-11"},{"title":"OnePlus 2 launch confirmed, to include Oxygen OS for Android v5.1 Video","date":"2015-06-10"},{"title":"YU Yuphoria review: Cyanogen OS on a budget, but comes with its flaws - Tech2","date":"2015-05-29"},{"title":"YU Yuphoria review: Cyanogen OS on a budget smartphone, but not without its flaws - Tech2","date":"2015-05-27"},{"title":"YU Yuphoria review: Cyanogen OS on a budget, but not without its flaws - Tech2","date":"2015-05-26"},{"title":"Leaked benchmark reveals OnePlus 2 runs on Snapdragon 810","date":"2015-05-21"},{"title":"OnePlus settles issues with Micromax; OnePlus One users will continue to get Cyanogen OS updates - Tech2","date":"2015-05-10"},{"title":"OnePlus settles issues with Micromax; One users will continue to get Cyanogen OS updates - Tech2","date":"2015-05-10"},{"title":"OnePlus settles issues with Micromax; users will get Cyanogen OS updates on the OnePlus One - Tech2","date":"2015-05-09"},{"title":"Cyanogen's phones will soon know who's calling before you do","date":"2015-05-07"},{"title":"Truecaller’s spam-blocker and caller ID technology are coming to Cyanogen OS","date":"2015-05-07"},{"title":"Micromax Yu YUREKA Available at Rs. 8999 [Open Sale Details]","date":"2015-04-30"},{"title":"ZDNet | Technology News, Analysis, Comments and Product Reviews for IT Professionals - Page 21 | ZDNet","date":"2015-04-21"},{"title":"Microsoft Just Took Android’s Future Out of Google’s Hands","date":"2015-04-17"},{"title":"How Microsoft Took Android’s Future Out of Google’s Hands | WIRED","date":"2015-04-17"},{"title":"Microsoft makes its boldest move yet to steal Android from Google","date":"2015-04-16"},{"title":"Daily Roundup: Social media at Coachella, new 'Star Wars' droid in real life and more!","date":"2015-04-16"},{"title":"Microsoft Will Bundle Its Apps on Cyanogen OS","date":"2015-04-16"},{"title":"Microsoft partners with Google's Android rival Cyanogen","date":"2015-04-16"},{"title":"Cyanogen 12 Lollipop is the most customisable OS yet","date":"2015-04-14"},{"title":"​CyanogenMod 12S comes to OnePlus One this week | ZDNet","date":"2015-04-13"},{"title":"ZDNet | Technology News, Analysis, Comments and Product Reviews for IT Professionals - Page 85 | ZDNet","date":"2015-04-11"},{"title":"OnePlus One finally gets its Lollipop update, but with a major twist","date":"2015-04-06"},{"title":"Cyanogen Completes $80M Series C Financing","date":"2015-03-23"},{"title":"Cyanogen rebrands itself, partners w/ Qualcomm to load its OS on reference devices","date":"2015-03-02"},{"title":"Alcatel's Hero 2+ will come to the US with Cyanogen OS","date":"2015-03-02"},{"title":"ASUS to Xiaomi: 5 smartphone brands to look out for in 2015","date":"2015-02-12"},{"title":"Micromax sells 10000 Yu Yureka smartphones in three seconds - Tech2","date":"2015-01-13"},{"title":"Micromax Yu Yureka receives 'phenomenal' response, sales to begin on 13 January on Amazon - Tech2","date":"2014-12-26"},{"title":"First Impressions: Micromax Yu Yureka with CyanogenMod looks promising at Rs 8,999 - Tech2","date":"2014-12-20"},{"title":"New CyanogenMod Installer app makes it even easier to install the custom ROM","date":"2013-11-12"}]}
