{"name":"kred","count":58,"items":[{"title":"There's a new app for rating people — and no, it won't bring on haters","date":"2015-10-02"},{"title":"61 key social media metrics, defined","date":"2015-03-22"},{"title":"61 Key Social Media Metrics, Defined","date":"2015-03-22"},{"title":"Brandwatch acquires London-based PeerIndex","date":"2014-12-17"},{"title":"Myscore takes off as indicator of influence on Facebook","date":"2014-09-16"},{"title":"LinkedIn-Owned Email Widget Rapportive Is About To Get Less Useful | TechCrunch","date":"2014-06-17"},{"title":"10 social analytics companies you need to know","date":"2014-06-05"},{"title":"10 Pro Online Reputation Management Tips For Local Businesses","date":"2014-01-27"},{"title":"Influencer Marketing: How Google Will Change The Game","date":"2013-12-17"},{"title":"Ninja Metrics’s Analytics Engine Tracks Social Influence in Dollars","date":"2013-11-13"},{"title":"5 Social Media Metrics that your Business Should Track","date":"2013-10-29"},{"title":"Prepare for the attack of the politiclones! | ZDNet","date":"2013-08-15"},{"title":"A Look At The Updated Conversation Prism And Changing Social Landscape","date":"2013-07-01"},{"title":"Chanel Leads Luxury Fashion Brands on Pinterest: Study","date":"2013-05-22"},{"title":"The Next Web","date":"2013-04-26"},{"title":"Twitter Settles High-Profile Legal Fight Over Data Access","date":"2013-04-25"},{"title":"Twitter Settles With PeopleBrowsr, Gives The Company Firehose Access Until The End Of The Year","date":"2013-04-25"},{"title":"How 'well' do you use social media? Two brothers built a social analytics platform to tell you | VentureBeat | Social | by Rebecca Grant","date":"2013-04-11"},{"title":"Editorial: Tech is a flock of starlings","date":"2013-03-18"},{"title":"Influence, vanity metrics and other internet astrology | ZDNet","date":"2013-02-14"},{"title":"Amazon Beats Out Apple For The Best Reputation Among U.S. Consumers, Says Harris; Google Comes Fourth","date":"2013-02-12"},{"title":"Kred Owner (And Twitter Firehose Contester) PeopleBrowsr Buys Swaylo, The Loose Thread Of Facebook&#8217;s Threadsy Buy","date":"2013-02-07"},{"title":"Twitter offers safe harbor to more app makers - CNET","date":"2013-01-17"},{"title":"Inside the Social Media Command Center at CES - CNET","date":"2013-01-08"},{"title":"Kred brings transparency to influencer and outreach analytics | ZDNet","date":"2013-01-02"},{"title":"More On PeopleBrowsr And Its CEO Jodee Rich, Who Has Been Involved In Long Legal Battles Before","date":"2012-11-29"},{"title":"Tech tiffs: Twitter and its firehose; Google, Facebook and social; Nokia-RIM patent row","date":"2012-11-29"},{"title":"Court Temporarily Protects PeopleBrowsr Access To Twitter Firehose, Twitter Says It Will &#8216;Vigorously Defend&#8217; Itself","date":"2012-11-28"},{"title":"When Marketing, PR And Technology Collide: Why Is PeopleBrowsr Going After Twitter, Exactly?","date":"2012-11-28"},{"title":"PeopleBrowsr wins temporary injunction against Twitter - CNET","date":"2012-11-28"},{"title":"Finding the revenue influencers: Pursway wants to be the Klout for sales","date":"2012-11-09"},{"title":"Salesforce adds Klout, Kred, & 18 more tools to Marketing Cloud for better social analytics | VentureBeat | Cloud | by Sean Ludwig","date":"2012-10-19"},{"title":"Salesforce.com's Marketing Cloud adds 20 social analytics vendors | ZDNet","date":"2012-10-19"},{"title":"Finding Social Media's Most Influential Influencers","date":"2012-10-18"},{"title":"Your Klout score must be greater than 35 to read this","date":"2012-10-08"},{"title":"14 strategies for finding and leveraging major online influencers | VentureBeat | Entrepreneur | by The Young Entrepreneur Council","date":"2012-09-12"},{"title":"Traitperception Wins Bizcamp Tel Aviv","date":"2012-09-04"},{"title":"Can Social Influence Be Distilled Into A Score? Part I, The Potential","date":"2012-08-30"},{"title":"Mention Klout on the TNW Backchannel? Things Get Heated","date":"2012-08-22"},{"title":"PeerIndex plans to take perks to the next level | ZDNet","date":"2012-07-20"},{"title":"Social curation site Fancy to compensate users for their influence","date":"2012-07-09"},{"title":"Kred Rewards and its Code of Conduct","date":"2012-06-29"},{"title":"Science Makes Its First Acquisition: Pinpuff, A Klout For Pinterest That Measures &#8216;Pinfluence&#8217;","date":"2012-06-26"},{"title":"Kred Starts Offering Rewards So Maybe You&#8217;ll Finally Give A Damn About Your Influence&nbsp;Score","date":"2012-06-26"},{"title":"Klout Is Not A Measure Of Social Influence - But It's A Nice Game","date":"2012-06-11"},{"title":"About.me Releases Public API, SDK At Disrupt, Now Integrates With Reputation, Smarterer, Forkly, Kred And Showyou","date":"2012-05-21"},{"title":"What Your Klout Score Really Means","date":"2012-04-24"},{"title":"The Difference Between Popularity And Influence Online","date":"2012-03-24"},{"title":"Klout and PeerIndex Don&#8217;t Measure Influence. Brian Solis Explains What They Actually&nbsp;Do","date":"2012-03-21"},{"title":"50 (mostly) free social media tools you can’t live without in 2012","date":"2012-03-18"},{"title":"Like it or not, the reputation graph is here to stay","date":"2012-01-04"},{"title":"Despite Attacks, Klout Is Poised To Boost Its&nbsp;Influence","date":"2011-12-29"},{"title":"You Know Your Klout Score. What's Your Kred Score?","date":"2011-12-22"},{"title":"2011: IT's year of consolidation | ZDNet","date":"2011-12-18"},{"title":"TechZulu • Take Back Your Internet, Leave Klout","date":"2011-11-23"},{"title":"Should you care how high your Klout score is?","date":"2011-10-27"},{"title":"The Next Web","date":"2011-09-30"},{"title":"You Might Have Klout, But What's Your&nbsp;Kred?","date":"2011-09-29"}]}
