{"name":"onavo-insights","count":23,"items":[{"title":"Ibotta Expands Beyond Mobile Coupons, Now Lets You Earn Cash Back From Restaurants, Fast Food & Home Improvement Stores","date":"2013-11-07"},{"title":"WeChat, Line use marketing might to upend rivals like WhatsApp, Viber - Tech2","date":"2013-10-23"},{"title":"Asia messaging apps seek to upend rivals with marketing might - Tech2","date":"2013-10-23"},{"title":"Twitter #Music reportedly a dud, may soon be shut down","date":"2013-10-22"},{"title":"Facebook heads to Israel with Onavo buy, gets a leg up on mobile data compression and analytics | VentureBeat | Deals | by Devindra Hardawar","date":"2013-10-14"},{"title":"Facebook Buys Mobile Data Analytics Company Onavo, Reportedly For Up To $200M… And (Finally?) Gets Its Office In Israel","date":"2013-10-13"},{"title":"Onavo Launches Acquisition Insights To Analyze App Marketing Tools","date":"2013-08-21"},{"title":"WhatsApp's Biggest Rival WeChat Now Has 236M Active Users Per Month","date":"2013-08-14"},{"title":null,"date":"2013-08-13"},{"title":"WhatsApp Doesn't Care About Stickers and Asian Chat Apps","date":"2013-08-08"},{"title":"Google+ Local App Killed Due to Extremely Low Usage","date":"2013-07-31"},{"title":"Onavo Count Gets a Slick New Look on Android","date":"2013-07-30"},{"title":"¿Cómo Ha Crecido Path? By Buying Ads In Spanish","date":"2013-06-14"},{"title":"Onavo: Arcade And Slot Machine Apps Most popular With iPhone Owners","date":"2013-05-23"},{"title":"Surprise: Yahoo’s mobile push is working better than you think","date":"2013-05-17"},{"title":"With $3.5M in funding, Any.DO proves an “Android first” app strategy can pay off","date":"2013-05-13"},{"title":"Intelligent To Do List App Any.DO Raises $3.5 Million, Will Further Expand Into Personal Productivity Space","date":"2013-05-13"},{"title":"Early Vine Use Sees Video App Rising On iOS While Cinemagram, Viddy, Socialcam All Decline","date":"2013-03-14"},{"title":"Who are the top VCs in mobile? Onavo dives into app market share to find out | VentureBeat | Mobile | by Devindra Hardawar","date":"2013-03-13"},{"title":"Onavo Insights taps real user data to see how mobile apps perform | VentureBeat | Mobile | by Devindra Hardawar","date":"2013-02-08"},{"title":"Finally, A Quantcast For Mobile Apps? Onavo Launches Insights","date":"2013-02-08"},{"title":"Onavo Launches Free 'Insights' iOS App Rankings","date":"2013-02-08"},{"title":"Nearly half of iPhone users use YouTube's app, report says - CNET","date":"2013-01-23"}]}
