{"name":"realtor-com","count":82,"items":[{"title":"News Corp posts quarterly loss as print ad sales fall","date":"2016-11-08"},{"title":"News Corp posts quarterly loss as print ad sales fall","date":"2016-11-07"},{"title":"Realtor.com® Launches 'Real Ambassador' Program","date":"2016-11-04"},{"title":"Markets Live: Profits pile in","date":"2016-08-09"},{"title":"Markets Live: Profits pile in","date":"2016-08-09"},{"title":"News Corp revenues boosted by legal win and property websites","date":"2016-08-09"},{"title":"Real estate to become the core of News Corp earnings","date":"2016-08-09"},{"title":"Zillow shares jump 7% following $130 million settlement over trade secrets","date":"2016-06-07"},{"title":"Zillow shares jump 7% following $130 million settlement over trade secrets","date":"2016-06-07"},{"title":"Zillow reaches $130M settlement with Move to end dispute over trade secrets and executive poaching","date":"2016-06-06"},{"title":"Zillow to pay Realtor.com $130 million over trade secrets","date":"2016-06-06"},{"title":"Dreamy new ads from Realtor.com put Elizabeth Banks on your deck and in your bathroom","date":"2016-06-01"},{"title":"Rulings cut potential damages against Zillow to $1.7B in Move dispute, analyst estimates","date":"2016-05-31"},{"title":"Judge sides with Zillow over destroyed evidence in Move dispute, but rules against a Zillow exec","date":"2016-05-18"},{"title":"Tech Moves: Former Microsoft exec to advise Wash. governor on tech industry development, Fred Hutch names new COO, and more","date":"2016-05-02"},{"title":"Week in Review: Most popular stories on GeekWire for the week of April 10, 2016","date":"2016-04-17"},{"title":"Zillow CEO Spencer Rascoff denies stealing Realtor.com’s secrets at contentious court hearing","date":"2016-04-13"},{"title":"Betrayal, deleted emails and allegations of stolen trade secrets: Court hearing in contentious $2B Move-Zillow suit begins","date":"2016-04-11"},{"title":"Malvertising Thrives in 'Shady' Parts of Highly-Automated Ad Networks","date":"2016-03-31"},{"title":"Zillow finds a second home in Centennial","date":"2016-02-21"},{"title":"A real estate story: three agents, three favorite apps","date":"2016-02-20"},{"title":"Zillow posts $47.6M loss amid costly legal battle with Move Inc., but boosts 2016 revenue projections","date":"2016-02-11"},{"title":"Culture Trends: Rent A Mom, Test Drive A Home Before Buying","date":"2016-01-22"},{"title":"Move Renews Westlake Village Lease","date":"2016-01-21"},{"title":"Buying or Selling a Home in 2016? Realtor.com® Helps Consumers Navigate the Process with Top Tips","date":"2015-12-21"},{"title":"News Corp’s Move buys real estate software startup Reesio","date":"2015-10-01"},{"title":"News Corporation to Buy Unruly for Up to $176 Million","date":"2015-09-16"},{"title":"Watch out Zillow: Realtor.com says it's the fastest growing in online real estate industry - GeekWire","date":"2015-08-12"},{"title":"Realtor.com CEO Ryan O'Hara on their quest to catch up with Zillow - GeekWire","date":"2015-08-06"},{"title":"The future of cards in Web design","date":"2015-07-15"},{"title":"30 Rock star Elizabeth Banks instructs folks how to buy homes in humorous video series from Realtor.com - GeekWire","date":"2015-07-08"},{"title":"Airbnb's New Partnership Lets You Test Out a Neighborhood Before Buying a Home","date":"2015-06-29"},{"title":"Xome launches new online home buying site in Zillow and Redfin's backyard - GeekWire","date":"2015-06-09"},{"title":"All’s fair in love and real estate? Realtor.com taps 30 Rock star in new ad campaign in battle for eyeballs with Zillow","date":"2015-05-13"},{"title":"Murdoch Bid to Dethrone Zillow Starts With Knocking Math","date":"2015-05-12"},{"title":"Zillow gets letter from former executive struck from trade secrets case","date":"2015-05-06"},{"title":"PropTiger and Makaan break the compound wall, gear up for bigger battles","date":"2015-04-30"},{"title":"Demand Media Onboards Rachel Glaser as CFO and Tawn Albright to Head Corporate Development","date":"2015-04-30"},{"title":"Demand Media Onboards Rachel Glaser as CFO and Tawn Albright to Head Corporate Development","date":"2015-04-30"},{"title":"Zillow accuses Move of scraping its listing data — after Move accused Zillow doing the same","date":"2015-04-21"},{"title":"Former Zillow vice president named as writer of accusation-laden letter","date":"2015-04-16"},{"title":"Zillow tries to coax listing data from multiple listing services with promise of free public records","date":"2015-04-16"},{"title":"Zillow fires back at Move in trade secrets case, gets parts of anonymous letter put under seal","date":"2015-04-14"},{"title":"Anonymous letter filed in trade secrets case accuses Zillow execs of illegal conduct","date":"2015-04-10"},{"title":"Zillow CEO Spencer Rascoff slams Move Inc. as legal tensions rise, dubs it a ‘crappy company’","date":"2015-03-31"},{"title":"Move accuses Zillow of using its information to buy Trulia in new legal filing","date":"2015-03-30"},{"title":"Tech Moves: ExtraHop recruits F5 exec as CIO, Move gets new CEO, and more","date":"2014-12-19"},{"title":"Move Inc. sues former exec who jumped to Zillow, alleging he dumped stock using inside information","date":"2014-12-10"},{"title":"News Corp Makes First Investment In India, Putting $30M Into Real Estate Site PropTiger","date":"2014-11-25"},{"title":"News Corp’s acquisition of Zillow rival Realtor.com closes","date":"2014-11-14"},{"title":"Zillow pushes back merger date with Trulia after FTC requests more info","date":"2014-11-12"},{"title":"Zillow considered buying Realtor.com, but wanted Trulia because they’re a brand on the ‘ascendancy’","date":"2014-10-03"},{"title":"News Corp. buying Move Inc. for $950M, knocking on the door of rival Zillow","date":"2014-09-30"},{"title":"News Corp. Buys Real Estate Listing Service Move for $950 Million","date":"2014-09-30"},{"title":"Porch adds former Market Leader CEO Ian Morris to board","date":"2014-08-27"},{"title":"Providing more clues to its future, Redfin seeks VP of real estate industry relations","date":"2014-08-11"},{"title":"Realtor association draws inspiration from Steve Jobs in wake of Zillow deal, says ‘data does not define us’ and time to ‘stand up for ourselves’","date":"2014-08-02"},{"title":"Real estate dominance: 5 reasons why Zillow is paying a big premium to buy Trulia","date":"2014-07-28"},{"title":"Why a Zillow acquisition of Trulia makes a ton of sense, and a few reasons why it doesn’t","date":"2014-07-25"},{"title":"Looking to catch to Trulia and Zillow, Realtor.com unveils new ‘Real People’ ads","date":"2014-07-14"},{"title":"Zillow inks deal with MSN Real Estate, taking over from Move Inc.’s Realtor.com","date":"2014-07-01"},{"title":"Zillow’s value passes major real estate firm, stock continues meteoric rise","date":"2014-06-20"},{"title":"Shares of Move Inc. jump on speculation of Trulia buyout","date":"2014-06-17"},{"title":"Realtor.com takes on Zillow with new app for Windows Phone; Redfin unveils redesigned iPhone app","date":"2014-05-22"},{"title":"Zillow stock hits all-time high as prime homebuying season kicks off","date":"2014-05-19"},{"title":"Ad wars: Realtor.com tries to pull users from Zillow and Trulia with new ‘Accuracy Matters’ campaign","date":"2014-05-14"},{"title":"GeekWire Awards: Vote for Hire of the Year","date":"2014-04-23"},{"title":"Court denies Move’s motion to block new Zillow employee","date":"2014-04-14"},{"title":"Meet Zillow’s new $5 million man: A guy so valuable that Move Inc. is suing over him","date":"2014-04-09"},{"title":"Porch Offers Detailed Reports About A Home’s Past Improvement Projects To Realtor.com Users | TechCrunch","date":"2014-03-25"},{"title":"The Move exec who got sued after joining Zillow talks about why he made the leap","date":"2014-03-24"},{"title":"Move and National Association of Realtors Sue Zillow After It Poached Former President Of Realtor.com","date":"2014-03-17"},{"title":"Zillow poaches one Move exec, gets sued for hiring another","date":"2014-03-17"},{"title":"Zillow Hires Former Realtor.com President To Run Its B2B Business","date":"2014-03-05"},{"title":"Zillow inks deal with AOL Real Estate, Trulia completes $223M financing","date":"2013-12-18"},{"title":"Interested in Real Estate and Technology? Move Canada is Hiring for Interactive Team","date":"2012-09-14"},{"title":"Interested in Real Estate and Technology? Move Canada is Hiring","date":"2012-05-04"},{"title":"Yelp files for $100M IPO, aiming to prove doubters wrong - CNET","date":"2011-11-17"},{"title":"In A Down Real Estate Market, Trulia Scratches At&nbsp;Profitability","date":"2010-10-12"},{"title":"CyberHomes Emerges From Beta, With Claims of Better Real-Estate Data","date":"2007-11-11"},{"title":"A Real Estate Vertical Search Roundup, Part 2","date":"2006-06-12"},{"title":"Homestore Rebrands As Move.com","date":"2006-05-26"}]}
