{"name":"rotten-tomatoes","count":196,"items":[{"title":"Google adds the option to rate movies and TV shows on search results page","date":"2016-12-09"},{"title":"Fandango Gobbles Up Cinepapaya","date":"2016-12-02"},{"title":"Fandango Purchases Latin American Ticketer Cinepapaya","date":"2016-12-01"},{"title":"Fandango Acquires Peru-based Cinepapaya","date":"2016-12-01"},{"title":"Fandango Buys Latin American Ticket-Seller Cinepapaya","date":"2016-12-01"},{"title":"Amazon’s ‘The Grand Tour’ Breaks Viewership Records On Prime","date":"2016-11-23"},{"title":"Influenced by critics? This platform claims to give the most unbiased movie reviews and recommendations","date":"2016-08-24"},{"title":"Snapchat reportedly acquires mobile search engine Vurb","date":"2016-08-16"},{"title":"5 ways to find good movies or TV shows to watch next on Netflix","date":"2016-08-16"},{"title":"Report: Snapchat claimed to be acquiring mobile search and discovery app Vurb","date":"2016-08-15"},{"title":"Over 18,000 Suicide Squad fans sign petition to shut down Rotten Tomatoes in response to bad reviews","date":"2016-08-04"},{"title":"Why Film Buffs Are Flocking to Rotten Tomatoes Competitor Cinesift","date":"2016-07-26"},{"title":"Disney’s App Will Narrate ‘Finding Dory’ Movie For Blind Moviegoers","date":"2016-06-17"},{"title":"T-Mobile’s New Customer Reward Program Includes Free T-Mobile Stock","date":"2016-06-06"},{"title":"The new 'X-Men' is going to dominate the weekend box office, despite mixed reviews","date":"2016-05-28"},{"title":"This is the Netflix hack the world has been waiting for","date":"2016-05-21"},{"title":"Why the great 'Captain America: Civil War' might save the superhero movie","date":"2016-05-06"},{"title":"Dick Smith closing down sale: the strangest, saddest stuff that's left","date":"2016-04-28"},{"title":"Dick Smith closing down sale: the strangest, saddest stuff that's left","date":"2016-04-28"},{"title":"AOL’s Moviefone to End Partnership With Whalerock","date":"2016-03-22"},{"title":"Fandango makes move into streaming content","date":"2016-03-21"},{"title":"Financial advisers' backgrounds as easy to check as movie reviews","date":"2016-03-16"},{"title":"Fandango to Rebrand M-Go Video Service ‘FandangoNow’","date":"2016-03-16"},{"title":"Can we predict Oscar winners using data analytics alone?","date":"2016-02-26"},{"title":"ESPN's FiveThirtyEight: 'We won't go the way of Grantland'","date":"2016-02-24"},{"title":"Comcast: Rotten Tomatoes reviews to remain independent","date":"2016-02-23"},{"title":"M&A roundup - week ending 2/20/16","date":"2016-02-20"},{"title":"Comcast's Fandango acquires Rotten Tomatoes and Flixster to build movie-discovery empire","date":"2016-02-18"},{"title":"Fandango, The Site That Sells You Movie Tickets, Acquires Flixster and Rotten Tomatoes","date":"2016-02-18"},{"title":"Tech Roundup: Google Express comes to LA, Rotten Tomatoes acquired and more","date":"2016-02-18"},{"title":"Fandango Buys Rotten Tomatoes, Flixster","date":"2016-02-17"},{"title":"Movie Ticketing Site Fandango Buys Rotten Tomatoes and Flixster","date":"2016-02-17"},{"title":"Fandango acquires Rotten Tomatoes and Flixster","date":"2016-02-17"},{"title":"Fandango Buys Rotten Tomatoes, Flixster From Warner Bros.","date":"2016-02-17"},{"title":"Fandango just snapped up Rotten Tomatoes and Flixster","date":"2016-02-17"},{"title":"Fandango buys Rotten Tomatoes and Flixster so moviegoers never have to go anywhere else (ever)","date":"2016-02-17"},{"title":"Fandango is acquiring Rotten Tomatoes and Flixster to round out its movie offerings","date":"2016-02-17"},{"title":"Fandango Acquires Flixster, Rotten Tomatoes","date":"2016-02-17"},{"title":"Comcast's Fandango acquires Rotten Tomatoes and Flixster to build movie-discovery empire","date":"2016-02-17"},{"title":"Media: Straight Outta Compton HD download $10, Weeds Complete Collection on Blu-ray $45, much more","date":"2016-02-16"},{"title":"iTunes Movie Trailers app makes its way to Canada","date":"2016-02-10"},{"title":"Funniest Amazon movie reviews you’ve ever seen","date":"2016-02-10"},{"title":"Bernie Sanders once played a rabbi in a low-budget 90s romantic comedy -- and his cameo is amazing","date":"2016-02-04"},{"title":"The internet bundle is already here","date":"2016-01-28"},{"title":"How to find something you'll like on Netflix, Stan and Presto","date":"2016-01-12"},{"title":"This is the Netflix hack the world has been waiting for","date":"2016-01-06"},{"title":"An incredible number of people are seeing 'Star Wars: The Force Awakens' twice or more in theaters","date":"2016-01-01"},{"title":"Nearly half of people who saw Star Wars want to re-watch, Fandango study says","date":"2015-12-31"},{"title":"An insanely high percentage of people -- about 42% -- are seeing \"Star Wars: The Force Awakens\" multiple times in theatres","date":"2015-12-31"},{"title":"Hollywood Execs Flock to Mtime's China Merchandising Expo (Exclusive)","date":"2015-12-14"},{"title":"China's Mtime Launches App for Box-Office Tracking, Movie Merchandising (Exclusive)","date":"2015-12-10"},{"title":"Watch 'Creed' Star Michael B. Jordan Get Knocked Out On Set In Sylvester Stallone Video","date":"2015-12-09"},{"title":"This new website rates horror movies based on how scary they are","date":"2015-10-28"},{"title":"This new website rates horror movies based on how scary they are","date":"2015-10-28"},{"title":"Four more Transformers movies on the way, Hasbro says","date":"2015-10-05"},{"title":"The Evolving Landscape Of Recommendation Systems","date":"2015-09-29"},{"title":"First Impressions of 'Steve Jobs' Film: 'Thrilling... an Action Movie Driven Almost Exclusively by Words'","date":"2015-09-06"},{"title":"Every episode of 'Mr. Robot' got a 100% rating on Rotten Tomatoes","date":"2015-09-04"},{"title":"From 'visionary' to 'a-hole,' that Steve Jobs' doc 'The Man in the Machine' is getting mixed reviews - GeekWire","date":"2015-09-04"},{"title":"The best movies on Netflix right now","date":"2015-09-03"},{"title":"Before he self destructed: chronicling the fall of 50 Cent","date":"2015-08-24"},{"title":"Search App Vurb Adds Messaging To Become The U.S. WeChat","date":"2015-08-20"},{"title":"Sky+ HD is rolling out a movie-centric UI today","date":"2015-08-20"},{"title":"Search App Vurb Adds Messaging To Become The U.S. WeChat","date":"2015-08-20"},{"title":"Plex for iOS just got a big redesign","date":"2015-08-10"},{"title":"Plex for iOS updated w/ Rotten Tomatoes integration, refreshed interface, more","date":"2015-08-10"},{"title":"Winning Wasp and peak Paul Rudd: 6 reasons 'Ant-Man' has legs - CNET","date":"2015-08-08"},{"title":"All 39 Marvel movies ranked from best to worst by Rotten Tomatoes","date":"2015-07-16"},{"title":"How have you used Netflix this long without knowing these 10 tips and tricks?","date":"2015-07-09"},{"title":"'Steve Jobs,' featuring Michael Fassbender, might be the awesome biopic we've been waiting for - GeekWire","date":"2015-07-01"},{"title":"First look: OS X El Capitan brings a little Snow Leopard to Yosemite","date":"2015-06-15"},{"title":"How pretentious is your taste in movies?","date":"2015-05-04"},{"title":"iOS app security is compromised by critical bug","date":"2015-04-20"},{"title":"The 10 best movies you can stream on Netlix right now","date":"2015-04-03"},{"title":"The 10 best TV shows you can stream on Netflix right now","date":"2015-04-03"},{"title":"5 free apps every Netflix user needs to know about","date":"2015-03-23"},{"title":"Vurb launches its uber-app as the conductor of your app symphony","date":"2015-02-26"},{"title":"Vurb Is Crazy Enough To Fight Google","date":"2015-02-26"},{"title":"JustWatch Debuts A New Search Engine For Cord Cutters","date":"2015-02-05"},{"title":"The best Netflix tools: Use these 10 tricks and tips to get the most out of your subscription","date":"2015-01-01"},{"title":"I streamed 'The Interview' and now I need some eggnog - CNET","date":"2014-12-24"},{"title":"'The Interview' earns rave reviews -- without anyone seeing it","date":"2014-12-22"},{"title":"The Interview Scores a Perfect 10 on IMDb","date":"2014-12-22"},{"title":"People Who Haven’t Seen The Interview Think It’s Totally Awesome","date":"2014-12-22"},{"title":"The internet decides that The Interview is a perfect movie","date":"2014-12-22"},{"title":"Tools to Track Your Music, Movie and Reading Habits","date":"2014-12-11"},{"title":"Researchers used Jackie Chan's 'Police Story 3: Supercop' to improve solar cells","date":"2014-11-25"},{"title":"As Netflix shuts down its API, startup A Better Queue is taken down with it","date":"2014-11-17"},{"title":"You'll Never Not Know What To Watch On Netflix Again","date":"2014-10-30"},{"title":"Looking For Netflix’s Highest-Rated Titles? This Site Can Help","date":"2014-10-30"},{"title":"20 essential Roku channels for dedicated couch potatoes","date":"2014-08-11"},{"title":"Disrupt Winner Vurb Raises $8 Million To Steal Mobile Search From Google | TechCrunch","date":"2014-08-07"},{"title":"Movies Based on Videogames Suck. Do They Have To?","date":"2014-07-27"},{"title":"Why Apple Dropped Yahoo For Its Weather App In iOS 8 | TechCrunch","date":"2014-06-22"},{"title":"Vurb’s Contextual Search Engine Blows Away Those Stupid Lists Of Links | TechCrunch","date":"2014-05-05"},{"title":"Tips and Tricks for Getting the Most out of Netflix","date":"2014-04-10"},{"title":"Ashton Kutcher's 'Jobs' Is Now Streaming On Netflix | Cult of Mac","date":"2014-03-25"},{"title":"Veronica Mars","date":"2014-03-17"},{"title":"Our Favorite Android, iOS, and Windows Phone Apps of the Week","date":"2014-02-28"},{"title":"New Android homescreen app says context is everything","date":"2014-02-04"},{"title":"American Hustle's Golden Globe Comedy Nod Shows Awards-Season Push","date":"2013-12-19"},{"title":"Google Search for Android update now finds information inside your installed apps","date":"2013-12-04"},{"title":"The Video Recommendation Engine Behind The Xbox Launches A Standalone iPad App","date":"2013-11-05"},{"title":"Can digital rentals block piracy? New site gathers the data","date":"2013-10-15"},{"title":"Three Galaxy Tab 3 tablets coming in early July - CNET","date":"2013-06-24"},{"title":"The Xbox One and live TV -- here's what to expect","date":"2013-06-19"},{"title":"Pinterest now offers more than pretty pictures - CNET","date":"2013-05-20"},{"title":"Pinterest updated to introduce more useful pins - Tech2","date":"2013-05-20"},{"title":"Pinterest Launches Pins With More Info And A New Button For Mobile Apps","date":"2013-05-19"},{"title":"Movie time: Flixster arrives on Xbox Live","date":"2013-04-17"},{"title":"Flixster on Xbox Live in the US: Buy or Rent SD and HD Movies","date":"2013-04-16"},{"title":"Flixster is now on the Xbox 360, UltraViolet library in-hand","date":"2013-04-16"},{"title":"Great Workflows To Help You Get More Done With Alfred 2.0 [Feature] | Cult of Mac","date":"2013-03-22"},{"title":"Alfred v2 brings Workflows, automates what Automator might not","date":"2013-03-15"},{"title":"Alfred 2.0 launches with new Workflows, better customization, and improved contact search support","date":"2013-03-14"},{"title":"Alfred Launches Version 2.0 Of Its Productivity App for OS X","date":"2013-03-14"},{"title":"Google updates Search app for Android, introduces Google Now widget","date":"2013-02-14"},{"title":"Google Now gets new widget, but UK misses fresh features - CNET","date":"2013-02-14"},{"title":"Google Now widget wanders in with Search for Android update","date":"2013-02-14"},{"title":"Google Now widget comes to search app for Android 4.1 - CNET","date":"2013-02-13"},{"title":"Google Now updated with support for widgets, added information sources","date":"2013-02-13"},{"title":"Google Search app for Android updated with Google Now widget, Fandango movie passes, ratings from Rotten Tomatoes, and Zillow listings","date":"2013-02-13"},{"title":"Google Now For Android Integrates Rotten Tomatoes Reviews, Fandango Tickets And Zillow Real Estate Listings","date":"2013-02-13"},{"title":"Upcoming Alfred 2.0 app adding Workflows, a simple visual tool for creating strings of actions","date":"2012-12-14"},{"title":"Siri can buy your movie tickets in iOS 6.1 | VentureBeat | Mobile | by Devindra Hardawar","date":"2012-11-04"},{"title":"Path targets its family audience with new iPad app and landscape mode","date":"2012-11-01"},{"title":"Google Releases Free Siri Competitor for iOS","date":"2012-10-30"},{"title":"With redesign, Flixster focuses on discoverability and direct movie sales","date":"2012-09-04"},{"title":"With An Eye Toward Video Discovery, Flixster Relaunches To Help Users Navigate The World Of Movies Online","date":"2012-09-04"},{"title":"Revamped Flixster.com gives one-stop digital movie access for both UltraViolet and non-UV stores","date":"2012-09-04"},{"title":"Major Path update lets you 'nudge' inactive friends back onto the service","date":"2012-07-26"},{"title":"Get This App: Can I Stream It?","date":"2012-07-03"},{"title":"Apple's Siri wrong 38 percent of the time in test - CNET","date":"2012-06-30"},{"title":"iOS 6: A Deeper Look at Its 10 Coolest Features | WIRED","date":"2012-06-11"},{"title":"iOS 6 Will Be Great For Local Businesses, Here's Why [Opinion] | Cult of Mac","date":"2012-06-11"},{"title":"10 best Android movie player apps","date":"2012-04-22"},{"title":"Tweek.tv’s social TV guide comes to the iPad","date":"2012-03-19"},{"title":"Movie Reviews Make All The Difference For Apple TV","date":"2012-02-20"},{"title":"iOS Apps To Make You The Perfect Catch This Valentine's Day [App Guide] | Cult of Mac","date":"2012-02-12"},{"title":"Discovr Movies is your ticket to half a million films via your Apple device","date":"2011-12-20"},{"title":"Now Get a Free Personal Assistant on your Phone with myBantu","date":"2011-11-09"},{"title":"iOS 5 and iCloud: everything you need to know","date":"2011-11-02"},{"title":"iTunes Movie Trailers app brings film previews, showtimes, and more to iOS","date":"2011-10-12"},{"title":"How big data could change what you watch on TV","date":"2011-07-21"},{"title":"How Traditional Entertainment Can Use Social Media","date":"2011-05-10"},{"title":"Warner Bros. Push For Digital Leadership Continues With Flixster Purchase","date":"2011-05-05"},{"title":"Warner Bros. Bets on Future of Movie Watching With Flixster Buy","date":"2011-05-04"},{"title":"Warner Bros. to buy Flixster, Rotten Tomatoes - CNET","date":"2011-05-04"},{"title":"Warner Bros. Acquires Social Movie Site Flixster (And Rotten&nbsp;Tomatoes)","date":"2011-05-04"},{"title":"Warner Buys Flixster & Rotten Tomatoes, Plans VOD Service","date":"2011-05-04"},{"title":"Is BuddyTV on the block?","date":"2011-03-16"},{"title":"Movie review: Astroturf Wars","date":"2011-02-11"},{"title":"Windows Phone 7 Wednesday; What's at the movies? | ZDNet","date":"2011-02-02"},{"title":"News Corp. Sells Fox Mobile Group To Investment Firm&nbsp;Jesta","date":"2010-12-22"},{"title":"Bing gets modest face-lift, task improvements - CNET","date":"2010-12-15"},{"title":"New Web Service Solves the What to Watch Conundrum","date":"2010-11-19"},{"title":"In Preparation For Sale To Rubicon Project, Fox Audience Network Fires Half Its&nbsp;Staff","date":"2010-10-28"},{"title":"Glam Media Will Sell E! Online’s European Ad Slots","date":"2010-10-20"},{"title":"Rotten Tomatoes Makes Your Facebook Friends Movie Critics","date":"2010-09-17"},{"title":"Facebook Pushes Ahead With Instant Personalization","date":"2010-09-17"},{"title":"How Flixster Found Its Groove (and Profitability)","date":"2010-09-16"},{"title":"Flixster Hits 20 Million App Downloads. Top Movie App On iPhone, Android, And&nbsp;BlackBerry","date":"2010-08-20"},{"title":"The Next Web","date":"2010-08-10"},{"title":"Flixster teams up with Roku, bringing movie trailers to your television","date":"2010-08-04"},{"title":"Hands-on With The New Flixster Roku Channel","date":"2010-08-03"},{"title":"Blu-ray releases on August 3rd 2010","date":"2010-08-03"},{"title":"iPad App Roundup: 6 Television & Movie Apps","date":"2010-08-03"},{"title":"Ars asks: What’s in your home theater system?","date":"2010-07-07"},{"title":"Project Leap hopes to hop into your TV screen, source-agnostic VOD in tow","date":"2010-06-11"},{"title":"iTunes Store Gets Movie Reviews From Rotten Tomatoes","date":"2010-05-20"},{"title":"Top 10 Android Apps for Entertainment","date":"2010-05-04"},{"title":"News Corp. Throwing Away The Crown Jewel: Fox Audience&nbsp;Network","date":"2010-03-22"},{"title":"The Ten Most Likely M&amp;A Deals In Online&nbsp;Video","date":"2010-02-28"},{"title":"News Corp. Got $12.5 Million In Flixster Stock For Rotten Tomatoes","date":"2010-02-09"},{"title":"Flixster issues $12.5M in stock to News Corp (updated) | VentureBeat | Social | by Camille Ricketts","date":"2010-02-08"},{"title":"Updated: Flixster Issues $12.5 Million In Shares To News Corp For Rotten Tomatoes","date":"2010-02-08"},{"title":"The Next Web","date":"2010-01-10"},{"title":"News Corp. Unloads Rotten Tomatoes Onto Flixster","date":"2010-01-04"},{"title":"News Corp/IGN Sells Off Rotten Tomatoes To Flixster; Retains Minority in Combo","date":"2010-01-04"},{"title":"Movie review site Flixster buys rival Rotten Tomatoes from Murdoch | VentureBeat | News | by Paul Boutin","date":"2010-01-04"},{"title":"News Corp. Unloads Rotten Tomatoes Onto Flixster","date":"2010-01-04"},{"title":"UGC Buys Out the Critics: Flixster Acquires Rotten Tomatoes","date":"2010-01-04"},{"title":"Flixster/Rotten Tomatoes/MySpace mystery solved - CNET","date":"2009-12-25"},{"title":"Flixup Brings Its Movie Tweet Aggregator To The Web For The Holiday Movie Season","date":"2009-12-24"},{"title":"Vid-Biz: News Corp., VideoEgg, YouTube","date":"2009-12-15"},{"title":"MySpace eyes Flixster for acquisition - CNET","date":"2009-12-14"},{"title":"Movies by Flixster for iPhone and Android - CNET","date":"2009-11-01"},{"title":"The Next Web","date":"2009-08-10"},{"title":"20 Palm Pre apps you should try today","date":"2009-06-15"},{"title":"Flixster Comes to Android","date":"2009-05-14"},{"title":"Glue Update Offers ‘Connected Conversations,’ Better Recommendations","date":"2009-04-07"},{"title":"Top 10 movie recommendation engines - CNET","date":"2009-03-19"},{"title":"FIM Trims About 100 Jobs, Mostly At Photobucket And Corporate","date":"2009-01-26"},{"title":"SnapTell for iPhone looks up books and music, but is limited","date":"2008-11-20"},{"title":"‘Glue’ Toolbar: Your Friends Are in Your Web, Helping You","date":"2008-11-13"},{"title":"Industry Moves: WB; Rotten Tomatoes; IAB; ESPN; MSN UK","date":"2008-06-27"}]}
