{"name":"square-order","count":76,"items":[{"title":"How to Crack the Mobile Payments Market","date":"2016-01-06"},{"title":"How to Crack the Mobile Payments Market","date":"2016-01-06"},{"title":"Square officially files for IPO","date":"2015-10-14"},{"title":"Why Jack Dorsey Is Ready to Save Twitter","date":"2015-10-02"},{"title":"Jack Dorsey Says He Will Not Leave His Role as Square CEO","date":"2015-06-16"},{"title":"The smart card: Apple Pay competitor or simple stopgap? - CNET","date":"2015-05-25"},{"title":"Technology Again Changing the Way We Order Coffee","date":"2015-04-09"},{"title":"Square rolls out Open Tickets so you can keep your tab open at bars | VentureBeat | Mobile | by Ruth Reader","date":"2015-04-02"},{"title":"Square will lay its Order app to rest on March 20th","date":"2015-03-15"},{"title":"Square Kills Square Order, the Food Pickup App That Was Square Wallet 2.0","date":"2015-03-14"},{"title":"Square is shutting down Square Order | VentureBeat | Business | by Ruth Reader","date":"2015-03-13"},{"title":"Square Is Shutting Down Its Order Food Pickup Service","date":"2015-03-13"},{"title":"Square rolls out charge-back protection for merchants | VentureBeat | Business | by Ruth Reader","date":"2015-03-09"},{"title":"Let's End Our Slavery to Screens","date":"2015-03-09"},{"title":"Square launches restaurant ordering app Caviar on Android | VentureBeat | Mobile | by Ruth Reader","date":"2015-03-03"},{"title":"This Rocket Will Help Put Humans on Mars","date":"2015-02-12"},{"title":"After Square Wallet Dies, Product Lead Exits","date":"2015-01-02"},{"title":"Starbucks Drops Square App as Mobile-Payments Battle Intensifies","date":"2014-12-22"},{"title":"Starbucks Severs Ties With Square","date":"2014-12-19"},{"title":"Square Shuffles Executive Roles as Product Portfolio Grows","date":"2014-12-11"},{"title":"Caviar launches iOS app for gourmet food delivery","date":"2014-12-04"},{"title":"Square launches old-school physical gift cards, replacing digital ones sent via email","date":"2014-11-18"},{"title":"Mobile payments to tally just 1% of all U.S. consumer spending in 2019","date":"2014-11-17"},{"title":"Jack Dorsey: Square has processed 1 billion payments to date | VentureBeat | Business | by Ruth Reader","date":"2014-11-05"},{"title":"The Next Web","date":"2014-11-05"},{"title":"Our Favorite Android, iOS, and Windows Phone Apps of the Week","date":"2014-10-12"},{"title":"The Week in iOS Apps: Gameboy style, video editors, and updates from Square","date":"2014-10-09"},{"title":"Square’s Order App Can Now Predict When You’ll Arrive To Pick Up Your Cappuccino | TechCrunch","date":"2014-10-08"},{"title":"Square refines its order-ahead app, so your coffee is ready when you show up","date":"2014-10-08"},{"title":"Square brews up a way to let you order coffee from your phone (but not at Starbucks)","date":"2014-10-08"},{"title":"Square now tells your barista when to start brewing","date":"2014-10-08"},{"title":"Location, location, location: Square’s favorite new toy is proximity","date":"2014-10-08"},{"title":"Square Now Knows When You're Nearing a Cafe, Will Have Your Order Ready","date":"2014-10-08"},{"title":"Square Lets You Pre-Order Coffee So It's Hot When You Arrive","date":"2014-10-08"},{"title":"Order Ahead with Square Order App and Pickup Whenever","date":"2014-10-08"},{"title":"Square's massive new funding isn't good news for the company","date":"2014-10-06"},{"title":"$150M in Funding Gives Square a Chance to Fend Off Apple and Amazon | WIRED","date":"2014-10-06"},{"title":"Postmates launches new quick-delivery lunch service","date":"2014-10-06"},{"title":"$150M in Funding Gives Square a Chance to Fend Off Apple and Amazon","date":"2014-10-06"},{"title":"Square may be raising another $100M round, valuing the company at $6B | VentureBeat | Business | by Ruth Reader","date":"2014-09-12"},{"title":"Match or Mismatch?","date":"2014-08-11"},{"title":"Get it while it’s hot: Square fuels food delivery frenzy with Caviar acquisition","date":"2014-08-04"},{"title":"Square confirms acquisition of food delivery startup Caviar | ZDNet","date":"2014-08-04"},{"title":"Square Will Announce Acquisition of Food Delivery Startup Caviar This Week","date":"2014-08-04"},{"title":"How a Square-Caviar deal will bring fancy restaurants to your door","date":"2014-08-04"},{"title":"It’s Official: Square Acquires Food Delivery Service Caviar | TechCrunch","date":"2014-08-04"},{"title":"Curated Food Delivery Startup Caviar In Talks To Be Acquired By Square For $100 Million | TechCrunch","date":"2014-07-12"},{"title":"TechStars London Demo Day 2014: Meet The 11 Startups (And Our Picks) | TechCrunch","date":"2014-06-20"},{"title":"Square's New Business Strategy: Lend Money to Small Businesses","date":"2014-05-28"},{"title":"Groupon to Replace Nearly All of Its Merchants' Cash Registers With iPads","date":"2014-05-19"},{"title":"Square to let users share feedback with sellers via receipts - CNET","date":"2014-05-13"},{"title":"Yesterday Square gave up on Wallet and introduced Square Order. Now it's bringing the new Square Fee","date":"2014-05-13"},{"title":"Uber taught us one thing: lazy people are the best customers","date":"2014-05-13"},{"title":"Square's Next Move: Solving Shopping's Minor Problems, Again","date":"2014-05-13"},{"title":"Square launches Feedback, a digital receipt that lets buyers and sellers talk to one another","date":"2014-05-13"},{"title":"Square Launches A $10 Per Month Customer Feedback Tool For Sellers | TechCrunch","date":"2014-05-13"},{"title":"Square Angles In on Restaurants With Square Order App","date":"2014-05-12"},{"title":"Square pulls unsuccessful Square Wallet, tries again with new mobile payments app","date":"2014-05-12"},{"title":"Square Launches App for Ordering Ahead From Restaurants","date":"2014-05-12"},{"title":"Square bails on Wallet app in latest fallout from troubled Starbucks partnership","date":"2014-05-12"},{"title":"Square Wallet Had Everything Going for It. And Now It’s Dead","date":"2014-05-12"},{"title":"Square Wallet Had Everything Going for It. And Now It's Dead | WIRED","date":"2014-05-12"},{"title":"Square has given up on its payment app Square Wallet and removed it from the App Store. In its stead","date":"2014-05-12"},{"title":"LG teases G Watch, Square offers new way to pay","date":"2014-05-12"},{"title":"Engadget Daily: Twitter Mute, what you need to know about smart guns and more!","date":"2014-05-12"},{"title":"Square Order wants to be your new take-out app","date":"2014-05-12"},{"title":"Square's new app lets you pre-order food and drink before picking it up","date":"2014-05-12"},{"title":"Code/red: Net Neutrality Nonsense, Beats Banter","date":"2014-05-12"},{"title":"Mattermark Daily – Monday, May 12th","date":"2014-05-12"},{"title":"Square pulls Wallet & launches Order, another way to order food | VentureBeat | Lifestyle | by Eric Blattberg","date":"2014-05-12"},{"title":"Square removes Wallet from App Store, brings Order to life - CNET","date":"2014-05-12"},{"title":"Square Finally Gives Up on Square Wallet and Bets on New Order-Ahead App","date":"2014-05-12"},{"title":"Square retools consumer mobile payments, replacing Wallet with a new app called Order","date":"2014-05-12"},{"title":"Square's new Order app lets you skip the register altogether | Cult of Mac","date":"2014-05-12"},{"title":"With New Food App Square Order, Square Wants A Bigger Bite Of The Restaurant Industry","date":"2014-05-12"},{"title":"Square to replace its digital wallet app with one that lets you order dinner","date":"2014-05-12"}]}
