{"name":"trulia","count":42,"items":[{"title":"Energy-Efficient Homes Are Worth More. So Let’s Create an Easy Metric for Buyers","date":"2016-08-18"},{"title":"Why Neighborhoods.com is rethinking the way people look for homes","date":"2016-08-08"},{"title":"Zillow Group Announces New Features to the Premier Agent Program Designed to Help Agents and Teams Grow Their Business","date":"2016-03-31"},{"title":"TC Cribs: Trulia’s Cozy New Office Made Us Feel Right At Home","date":"2015-09-08"},{"title":"Zillow beats expectations with $171M revenue in Q2 as Trulia acquisition starts to pay off - GeekWire","date":"2015-08-04"},{"title":"How Businesses Are Leveraging Public Data To Reach Target Audiences","date":"2015-08-01"},{"title":"How Homebuyers Win Bidding Wars Without Having the Most Cash","date":"2015-07-28"},{"title":"Zillow takes direct swipe at DocuSign with acquisition of digital signature upstart DotLoop - GeekWire","date":"2015-07-22"},{"title":"Don’t trust real estate agents? Neither do these entrepreneurs. Here’s their solution","date":"2015-07-07"},{"title":"Steer clear of low-tech hacks: How to keep your information safe - CNET","date":"2015-07-05"},{"title":"Apple's Music Plans Have a Hitch: The Music Labels","date":"2015-06-02"},{"title":"Former CEO of Trulia Steps Down at Zillow Four Months After Acquisition","date":"2015-06-01"},{"title":"Zillow to acquire Trulia for $3.5B in stock - CNET","date":"2014-07-28"},{"title":"Tech Moves: Marina Martin named CTO of Veterans Affairs; Bob Bemis out at Zillow; Scout Analytics; and more","date":"2013-08-01"},{"title":"Trulia Now Allows You To Find And Promote Real Estate Agents","date":"2013-07-11"},{"title":"With $2.5M Injection From Nexus, Indian Housing Marketplace Launches In Bangalore","date":"2013-06-06"},{"title":"Trulia Adds New Maps To Visualize U.S. Rental Prices, Earthquake And Flood Risks","date":"2013-05-28"},{"title":"Trulia Acquires Market Leader For $355M To Take Its Business Beyond Listings And Into SaaS For Real Estate Professionals","date":"2013-05-08"},{"title":"Trulia Launches Redesigned iPad App With Improved Navigation, Listing Pages And Maps","date":"2013-04-23"},{"title":"Real Estate Site Trulia Files For $150M Follow-On Offering For More Acquisitions, Possibly Mergers","date":"2013-03-11"},{"title":"Trulia Launches Trulia Suggests, A Recommendation Engine For Real Estate","date":"2013-03-06"},{"title":"Trulia Beats Analysts With Record Q4 Revenue, But Posts Bigger-Than-Expected Net Loss","date":"2013-02-12"},{"title":"In Its First Report Since Going Public, Trulia Posts First Profitable Quarter, Record Revenue","date":"2012-11-07"},{"title":"Zillow CEO Spencer Rascoff: Startups that try to disrupt real estate commissions are doomed to fail","date":"2012-10-03"},{"title":"Uber And Trulia Partner To Give Prospective Renters Discounts On Car Rides","date":"2012-09-25"},{"title":"Real Estate Site Trulia Sees Shares Soar 40 Percent In First Day Of Trading, Valued At Over $500&nbsp;Million","date":"2012-09-20"},{"title":"Trulia Goes After Zillow&#8217;s Real Estate, Files $75M IPO; Now Has 22M Monthly Users","date":"2012-08-17"},{"title":"Real Estate Search Company Trulia Brings Its Rentals App To iPhone","date":"2012-04-04"},{"title":"Real Estate Platform Trulia Debuts Android Tablet And Rentals&nbsp;Apps","date":"2011-09-29"},{"title":"With An IPO On The Horizon, Trulia Adds Social Recommendations For Real Estate&nbsp;Professionals","date":"2011-07-28"},{"title":"In A Down Real Estate Market, Trulia Scratches At&nbsp;Profitability","date":"2010-10-12"},{"title":"Trulia Enters The Real Estate Rental Market And Starts Collecting Location&nbsp;Ratings","date":"2010-04-06"},{"title":"MLS Tired of Zillow, Trulia: Goes Direct To Consumers","date":"2008-11-10"},{"title":"And The Winner Of Our Dash GPS Contest Is . . .","date":"2008-10-02"},{"title":"And The Winner Of Our Dash GPS Contest Is . . .","date":"2008-10-01"},{"title":"Contest: We&#8217;re Giving Away A Dash GPS. Just Come Up With An App To Make It Better","date":"2008-09-25"},{"title":"Trulia Goes Mobile, Adds Feeds","date":"2008-08-25"},{"title":"Trulia Brings Sweet Eyecandy to.. the Housing Market?","date":"2008-05-29"},{"title":"Sequoia Leads Trulia&#8217;s $10 Million Series C","date":"2007-05-24"},{"title":"Trulia Out of Beta with New Features and Widgets","date":"2007-05-11"},{"title":"Trulia and Mashery Launch Real Estate Search API","date":"2007-02-20"},{"title":"Real Estate vertical search with Trulia","date":"2005-10-30"}]}
